tap 'homebrew/aliases'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'

tap 'aws/tap'
tap 'azure/functions'
tap 'beeftornado/rmtree'
tap 'c-bata/kube-prompt'
tap 'derailed/k9s'
tap 'derailed/popeye'
tap 'instrumenta/instrumenta'
tap 'jmespath/jmespath'
# Disabled. Not compatible with OS X 10.15+
# tap 'jabley/wrk2'
tap 'jtyr/repo'
tap 'kwilczynski/pkenv'
tap 'lucagrulla/tap'
tap 'martido/homebrew-graph'
tap 'miserlou/loop', 'https://github.com/Miserlou/Loop.git'
tap 'moncho/dry'
tap 'nickolasburr/pfa'
tap 'teamookla/speedtest'
tap 'tylerbrock/saw'
tap 'wagoodman/dive'
tap 'wallix/awless'
tap 'zloesabo/nettools'

# Disabled in favour of ripgrep.
# brew 'ack'
brew 'angle-grinder'
brew 'aria2'
brew 'asciinema'
brew 'autossh'
# Temporarily disabled.
# brew 'awless'
# brew 'aws-sam-cli'
brew 'awscli'
brew 'axel'
brew 'azure-cli'
brew 'azure-functions-core-tools'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bcal'
brew 'bench'
brew 'bitwise'
brew 'bmon'
brew 'brew-cask-completion'
brew 'caddy'
brew 'calc'
brew 'ccat'
brew 'cfssl'
brew 'cli53'
# Disabled in favour of git-delta.
# brew 'colordiff'
brew 'cowsay'
brew 'ctags'
# Disabled in favour of curl-openssl.
# brew 'curl'
brew 'curl-openssl'
# Temporarily disabled.
# brew 'cw'
brew 'devd'
# Disabled in favour of git-delta.
# brew 'diff-so-fancy'
brew 'direnv'
brew 'dive'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-squash'
brew 'dos2unix'
brew 'dry'
# Temporarily disabled.
# brew 'envchain'
brew 'exa'
brew 'exiftool'
brew 'fd'
brew 'fdupes'
brew 'findutils'
brew 'fping'
brew 'fpp'
brew 'fselect'
brew 'fx'
brew 'fzf'
brew 'gbt'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'git-delta'
brew 'git-extras'
brew 'git-flow'
brew 'gnu-sed'
brew 'gnupg2'
brew 'gpatch'
brew 'go'
brew 'grep'
brew 'gron'
# Temporarily disabled.
# brew 'grpcurl'
# brew 'helm'
brew 'hexyl'
brew 'hstr'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'hyperfine'
brew 'ipcalc'
brew 'iperf3'
# Temporarily disabled.
# brew 'jenv'
brew 'jid'
brew 'jp'
brew 'jq'
brew 'jump'
# Temporarily disabled.
# brew 'k9s'
# brew 'krew'
# brew 'kube-prompt'
# brew 'kubernetes-cli'
# brew 'kubespay'
# brew 'kubeval'
# brew 'lftp'
brew 'lnav'
brew 'loop', args: ['HEAD']
brew 'lua'
# Temporarily disabled.
# brew 'luarocks'
brew 'm-cli'
# Temporarily disabled.
# brew 'mackup'
brew 'mas'
brew 'md5sha1sum'
brew 'mkcert'
brew 'modd'
# Temporarily disabled.
# brew 'moreutils', link: false
brew 'mtr'
brew 'mutt'
brew 'ncdu'
brew 'neofetch'
brew 'ngrep'
brew 'nmap'
# Temporarily disabled.
# brew 'nnn'
brew 'node'
# Disabled in favour of pkenv.
# brew 'packer'
brew 'p7zip'
brew 'packer-completion'
brew 'parallel'
brew 'patchutils'
brew 'pcre'
brew 'peco'
brew 'pinentry-mac'
# Temporarily disabled.
# brew 'pipenv'
brew 'pkenv'
# Temporarily disabled.
# brew 'popeye'
brew 'pstree'
brew 'pth'
brew 'pv'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'rng'
brew 'rsync'
brew 'ruby-build'
brew 's-search'
# Temporarily disabled.
# brew 'saw'
brew 'scc'
# Disabled in favour of neofetch.
# brew 'screenfetch'
brew 'shellcheck'
brew 'socat'
brew 'speedtest'
brew 'sshfs'
brew 'step'
# Temporarily disabled.
# brew 'stern'
# Disabled in favour of tfenv.
# brew 'terraform'
brew 'tfenv'
# Disabled in favour of ripgrep.
# brew 'the_silver_searcher'
brew 'tig'
# Temporarily disabled.
# brew 'tldr'
brew 'tmux'
brew 'tokei'
brew 'tor'
brew 'torsocks'
brew 'tree'
brew 'unrar'
brew 'vagrant-completion'
# Temporarily disabled.
# brew 'vault'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'whatmask'
# Disabled in favour of wrk2.
# brew 'wrk'
# Disabled. Not compatible with OS X 10.15+
# brew 'wrk2', args: ['HEAD']
brew 'wuzz'
brew 'xsv'
brew 'xz'
brew 'yamllint'
brew 'yq'

cask_args appdir: '/Applications'

cask '1password'
cask 'all-in-one-messenger'
# Temporarily disabled.
# cask 'adobe-reader'
# cask 'android-file-transfer'
# cask 'atom'
# cask 'brave-browser'
cask 'charles'
# Temporarily disabled.
# cask 'chefdk'
cask 'cleanmymac'
cask 'cyberduck'
# Temporarily disabled.
# cask 'dash'
# cask 'discord'
cask 'docker'
# Temporarily disabled.
# cask 'dropbox'
# cask 'etcher'
# cask 'expressvpn'
cask 'exodus'
cask 'firefox'
# Temporarily disabled.
# cask 'flux'
cask 'gemini'
# Temporarily disabled.
# cask 'gitkraken'
cask 'google-chrome'
# Temporarily disabled.
# cask 'gpg-suite'
# cask 'google-cloud-sdk'
# cask 'google-drive'
# cask 'insomnia'
cask 'iterm2'
# Temporarily disabled.
# cask 'java'
cask 'karabiner-elements'
cask 'keybase'
cask 'libreoffice'
cask 'little-snitch'
# Temporarily disabled.
# cask 'macdown'
cask 'macs-fan-control'
# Temporarily disabled.
# cask 'micro-snitch'
cask 'microsoft-office'
cask 'postman'
# Disabled in favour of Magnet.
# cask 'rectangle'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
# Temporarily disabled.
# cask 'shadow'
# cask 'signal'
# cask 'skype'
# cask 'slack'
# cask 'soulver'
# Disabled in favour of Rectangle.
# cask 'spectacle'
cask 'spotify'
# Temporarily disabled.
# cask 'station'
# cask 'steam'
# cask 'telegram'
cask 'tor-browser'
# Temporarily disabled.
# cask 'tunnelblick'
# cask 'typora'
cask 'vagrant'
cask 'viber'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
# Temporarily disabled.
# cask 'vmware-fusion'
# cask 'whatsapp'
cask 'wireshark'
cask 'zoomus'

# Temporarily disabled.
# cask 'font-fira-code'
# cask 'font-fira-code-nerd-font'
# cask 'font-fira-mono'
# cask 'font-fira-mono-nerd-font'
# cask 'font-hack'
# cask 'font-hack-nerd-font'
# cask 'font-inconsolata'
# cask 'font-inconsolata-nerd-font'
# cask 'font-iosevka'
# cask 'font-iosevka-nerd-font'
# cask 'font-jetbrains-mono'
# cask 'font-jetbrains-mono-nerd-font'
# cask 'font-monoid'
# cask 'font-monoid-nerd-font'
# cask 'font-source-code-pro'
# cask 'font-ubnutu-mono-nerd-font'
# cask 'font-ubuntu'
# cask 'font-ubuntu-mono'
# cask 'font-ubuntu-nerd-font'

mas 'Magnet', id: 441258766
# Temporarily disabled.
# mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Owly', id: 882812218
mas 'Wireguard', id: 1451685025
