tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'beeftornado/rmtree'
tap 'jabley/homebrew-wrk2'
tap 'jmespath/jmespath'
tap 'kwilczynski/pkenv'
tap 'moncho/dry'
tap 'wagoodman/dive'
tap 'wallix/awless'
tap 'zloesabo/nettools'

brew 'ack'
brew 'asciinema'
brew 'autoconf'
brew 'automake'
brew 'autossh'
brew 'awless'
brew 'awscli'
brew 'axel'
brew 'azure-cli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bench'
brew 'bison'
brew 'brew-cask-completion'
brew 'caddy'
brew 'calc'
brew 'ccat'
brew 'cfssl'
brew 'cli53'
brew 'cmake'
brew 'colordiff'
brew 'cowsay'
brew 'ctags'
brew 'curl'
brew 'devd'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dive'
brew 'docker-squash'
brew 'dos2unix'
brew 'dry'
brew 'envchain'
brew 'exa'
brew 'fd'
brew 'fdupes'
brew 'findutils'
brew 'fpp'
brew 'fselect'
brew 'fx'
brew 'fzf'
brew 'gdbm'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'git-extras'
brew 'git-flow'
brew 'gnu-sed'
brew 'gnupg2'
brew 'go'
brew 'graphviz'
brew 'hexyl'
brew 'hstr'
brew 'grep'
brew 'gron'
brew 'htop-osx'
brew 'httpie'
brew 'httpstat'
brew 'hyperfine'
brew 'icu4c'
brew 'ipcalc'
brew 'jenv'
brew 'jid'
brew 'jp'
brew 'jq'
brew 'jump'
brew 'lftp'
brew 'libassuan'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn'
brew 'libksba'
brew 'libmagic'
brew 'libpng'
brew 'libtool'
brew 'libusb'
brew 'libusb-compat'
brew 'libyaml'
brew 'lnav'
brew 'lua'
brew 'makedepend'
brew 'mas'
brew 'mercurial'
brew 'mkcert'
brew 'modd'
brew 'mtr'
brew 'ncdu'
brew 'neofetch'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openssl'
# Disabled in favour of pkenv.
# brew 'packer'
brew 'packer-completion'
brew 'pcre'
brew 'peco'
brew 'pinentry-mac'
brew 'pkenv'
brew 'pkg-config'
brew 'pstree'
brew 'pth'
brew 'pv'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'rsync'
brew 'ruby-build'
brew 's-search'
brew 'screenfetch'
brew 'shellcheck'
brew 'socat'
brew 'sqlite'
brew 'step'
# Disabled in favour of tfenv.
# brew 'terraform'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tokei'
brew 'tor'
brew 'torsocks'
brew 'tree'
brew 'unrar'
brew 'vagrant-completion'
brew 'vim', args: ['lua']
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'whatmask'
# Disabled in favour of wrk2.
# brew 'wrk'
brew 'wrk2', args: ['HEAD']
brew 'wuzz'
brew 'xsv'
brew 'xz'

cask_args appdir: '/Applications'

cask '1password'
cask 'adobe-reader'
cask 'android-file-transfer'
cask 'atom'
cask 'charles'
cask 'chefdk'
cask 'cleanmymac'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'etcher'
cask 'expressvpn'
cask 'firefox'
cask 'flux'
cask 'gemini'
cask 'google-chrome'
cask 'google-drive'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'keybase'
cask 'libreoffice'
cask 'little-snitch'
cask 'macdown'
cask 'micro-snitch'
cask 'postman'
cask 'skype'
cask 'slack'
cask 'soulver'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'torbrowser'
cask 'tunnelblick'
cask 'typora'
cask 'vagrant'
cask 'vault'
cask 'virtualbox'
cask 'vlc'
cask 'vmware-fusion'
cask 'whatsapp'
cask 'wireshark'
cask 'zoomus'

mas 'Owly', id: 882812218
mas 'Microsoft Remote Desktop', id: 715768417
