tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'

tap 'aws/tap'
tap 'azure/functions'
tap 'beeftornado/rmtree'
tap 'derailed/k9s'
tap 'derailed/popeye'
# Disabled. Not compatible with OS X 10.15+
# tap 'jabley/wrk2'
tap 'jmespath/jmespath'
tap 'jtyr/repo'
tap 'kwilczynski/pkenv'
tap 'miserlou/loop', 'https://github.com/Miserlou/Loop.git'
tap 'moncho/dry'
tap 'nickolasburr/pfa'
tap 'wagoodman/dive'
tap 'wallix/awless'
tap 'zloesabo/nettools'

# Disabled in favour of ripgrep.
# brew 'ack'
brew 'angle-grinder'
brew 'aria2'
brew 'asciinema'
brew 'autoconf'
brew 'automake'
brew 'autossh'
brew 'awless'
brew 'aws-sam-cli'
brew 'awscli'
brew 'axel'
brew 'azure-cli'
brew 'azure-functions-core-tools'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bcal'
brew 'bench'
brew 'bison'
brew 'bitwise'
brew 'bmon'
brew 'brew-cask-completion'
brew 'caddy'
brew 'calc'
brew 'ccat'
brew 'cfssl'
brew 'cli53'
brew 'cmake'
# Disabled in favour of git-delta.
# brew 'colordiff'
brew 'cowsay'
brew 'ctags'
# Disabled in favour of curl-openssl.
# brew 'curl'
brew 'curl-openssl'
brew 'devd'
# Disabled in favour of git-delta.
# brew 'diff-so-fancy'
brew 'direnv'
brew 'dive'
brew 'docker-squash'
brew 'dos2unix'
brew 'dry'
brew 'envchain'
brew 'exa'
brew 'fd'
brew 'fdupes'
brew 'findutils'
brew 'fpp'
brew 'fselect'
brew 'fx'
brew 'fzf'
brew 'gbt'
brew 'gdbm'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'git-delta'
brew 'git-extras'
brew 'git-flow'
brew 'gnu-sed'
brew 'gnupg2'
brew 'go'
brew 'graphviz'
brew 'grep'
brew 'gron'
brew 'grpcurl'
brew 'hexyl'
brew 'hstr'
brew 'htop-osx'
brew 'httpie'
brew 'httpstat'
brew 'hyperfine'
brew 'icu4c'
brew 'ipcalc'
brew 'iperf3'
brew 'jenv'
brew 'jid'
brew 'jp'
brew 'jq'
brew 'jump'
brew 'k9s'
brew 'krew'
brew 'kubernetes-cli'
brew 'lftp'
brew 'lnav'
brew 'loop', args: ['HEAD']
brew 'lua'
brew 'makedepend'
brew 'mas'
brew 'md5sha1sum'
brew 'mercurial'
brew 'mkcert'
brew 'modd'
brew 'mtr'
brew 'mutt'
brew 'ncdu'
brew 'neofetch'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openssl'
# Disabled in favour of pkenv.
# brew 'packer'
brew 'packer-completion'
brew 'pcre'
brew 'peco'
brew 'pinentry-mac'
brew 'pkenv'
brew 'popeye'
brew 'pstree'
brew 'pth'
brew 'pv'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'rng'
brew 'rsync'
brew 'ruby-build'
brew 's-search'
brew 'screenfetch'
brew 'shellcheck'
brew 'socat'
brew 'sqlite'
brew 'step'
# Disabled in favour of tfenv.
# brew 'terraform'
brew 'tfenv'
# Disabled in favour of ripgrep.
# brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tokei'
brew 'tor'
brew 'torsocks'
brew 'tree'
brew 'unrar'
brew 'vagrant-completion'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'whatmask'
# Disabled in favour of wrk2.
# brew 'wrk'
# Disabled. Not compatible with OS X 10.15+
# brew 'wrk2', args: ['HEAD']
brew 'wuzz'
brew 'xsv'
brew 'xz'
brew 'yq'

cask_args appdir: '/Applications'

cask '1password'
# Temporarily disabled.
# cask 'adobe-reader'
# cask 'android-file-transfer'
# cask 'atom'
# cask 'brave-browser'
cask 'charles'
# Temporarily disabled.
# cask 'chefdk'
cask 'cleanmymac'
cask 'cyberduck'
# Temporarily disabled.
# cask 'dash'
# cask 'discord'
cask 'docker'
# Temporarily disabled.
# cask 'dropbox'
# cask 'etcher'
# cask 'expressvpn'
cask 'firefox'
# Temporarily disabled.
# cask 'flux'
cask 'gemini'
cask 'gitkraken'
cask 'google-chrome'
# Temporarily disabled.
# cask 'google-cloud-sdk'
# cask 'google-drive'
# cask 'insomnia'
cask 'iterm2'
# Temporarily disabled.
# cask 'java'
cask 'karabiner-elements'
cask 'keybase'
cask 'libreoffice'
cask 'little-snitch'
# Temporarily disabled.
# cask 'macdown'
cask 'macs-fan-control'
# Temporarily disabled.
# cask 'micro-snitch'
cask 'postman'
cask 'shadow'
cask 'signal'
cask 'skype'
cask 'slack'
# Temporarily disabled.
# cask 'soulver'
# cask 'spectacle'
cask 'spotify'
cask 'station'
# Temporarily disabled.
# cask 'steam'
cask 'tor-browser'
cask 'tunnelblick'
# Temporarily disabled.
# cask 'typora'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
# Temporarily disabled.
# cask 'vmware-fusion'
# cask 'whatsapp'
cask 'wireshark'
cask 'zoomus'

mas 'Magnet', id: 441258766
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Owly', id: 882812218
mas 'Wireguard', id: 1451685025
